#include <stdio.h>
#include <> 
int main(){
// getchar(c);//มันจะุเอาตัวเเรกที่เราพิมพ์มาเท่านั้นไม่ว่ามันจะยาวเเค่ไหนก็ตาม
// ต้องเผื่อที่ของ \0ด้วย
//arry in c ต้องกำหนดพื้นที่ให้มากก เพราะ ไม่สามารถเพิ่มพื่้นที่ได้
// 123\n\0  เอามาเเทนใน %s ที่เหลือจะขึ้นบรรทัดใหม่เราต้องเก็บ \0กะ \n ด้วย
//fgets(n, 5, st)
// //ถ้า a to อะไร มันจะเเสดง\0  ด้วย
// fgets(n, 5, stdin); ค่าที่ออกมาเป็นint
// int i = atoi(n); // atoi คือ เปลี่ยนจาก str char เป็นตัวเลข
// double d = atof(n);//atof เเปลงจาก str เป็นint
// long l = atol(n);
// 123\n\0
// printf("n = %s, i = %d ",n,i );
// put(n); // ใส่ตัวเลขไม่ได้ หรืออาจจะใช้ printf(%s)ก็ได้
// putchar(100);// putchar('h');
// int found = 0;
// float isIn = 0.0;
// char isExist = '\0';
// //  3 ตัวนี้จะเป้น false ทั้งหมด ที่เหลิอเป้นtrue
// // สามารถใช้กับ if ก็ได้
// if (i == 0){// ข้างในเป็นการเปรียบเทียบค่า 2 ค่า ถ้าเปรียบเทียบช่วงต้องทำ 
// if (i>0 && i<20){
//     prinf("if\n");
// // ถ้าอยาก มีเงื่อนไขอีกเงื่อนไขให้พิมพ์
// }else if(i < 100 || !found && isExist ){ // || คือ or ! found เป้นตัวกลับนิพจน์
//        printf("else if\n");
// } else if (i>='A' && i<='z'){// เป้นตัวเช็คค่าว่าอยู่ในช่วงไหม
//     printf("else if 2\n");
// }else{
//     printf("else\n");
//     printf("%d\n", i>0); //สามารถปริ้นค่าได้เพราะถ้ามันเป้นจริงเป็น 1 เป็นเท็จเป้น 0
// การวนลุปตั้งเเต่ 0 -  i
int count = 0;
while (count < i){ // บรรทัดนี้คือ binary
    printf("%d\n",count); // control c ใช้ในกรณีที่เกิด infinite loop
    count++;
}
// loop for ใช้ในการนับรอบอย่างเดียว
for (int j = 0; j< i : j+=){ //เงื่อนไขเเรกจะทำงานเเค่ครั้งเดียว ส่วนก้อนที่ 2 เป้นตัวตัดสินใจว่าจะทำงานไหม  ก้อนที่ 3
// เป้นตัวเพิ่มค่า ก้อนหลังจะทำก็ได้หรือไม่ทำก็ได้จะเรียกใช้งานเมื่อวนลุปเสร็จเเล้ว
}
    printf("%d\n",j);
for (int j = 0; 1 : j++); {// เกิด infi
}
}
while (1){ //ใช้ในกรณีที่เป้น while True ใช้ในกรรีที่เป็นวนซ้็ำ
}




}
}


